tup=("罗琨","bashful","bold",18,15484551)
print("",tup[0],tup[1],tup[3])
print("",tup[2:-1])
tup1=('who','am','I?')
tup2=tup+tup1
print(tup2*2)
del tup2
print('========================================================================================================')
dict={'小明':62,'小军':33,'雄安':18}
print(dict)
print("",len(dict))
print("",dict.keys(),dict.values())
dict['甜菜']=99
dict['小军']=60
del dict['小明']
print(dict)
print('============================================================================================================')
set1={'a','e','i','o','u'}
set2={'a','o','e','i','u','v'}
set1.remove('u');
print(set1,set2)
print(set1|set2,set1&set2)
print('---------------------------------------------------------------------------------------------')
